# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [27]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [28]:
first = pd.Series(np.random.randint(1, 5, 100))
second = pd.Series(np.random.randint(1, 4, 100))
third = pd.Series(np.random.randint(10_000, 30_001, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [29]:
df = pd.concat([first, second, third], axis=1)
df

    0  1      2
0   2  3  24418
1   3  1  23079
2   4  3  25056
3   2  2  22996
4   1  2  10276
.. .. ..    ...
95  2  2  15279
96  3  3  29963
97  4  2  19831
98  2  1  16871
99  4  3  20748

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [30]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       2       3            24418
1       3       1            23079
2       4       3            25056
3       2       2            22996
4       1       2            10276
..    ...     ...              ...
95      2       2            15279
96      3       3            29963
97      4       2            19831
98      2       1            16871
99      4       3            20748

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [31]:
one = pd.concat([first, second, third], axis=0)
one

0         2
1         3
2         4
3         2
4         1
      ...
95    15279
96    29963
97    19831
98    16871
99    20748
Length: 300, dtype: int64

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [32]:
print('yes')

yes

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [33]:
one = one.reset_index(drop=True)
one

0          2
1          3
2          4
3          2
4          1
       ...
295    15279
296    29963
297    19831
298    16871
299    20748
Length: 300, dtype: int64